
/*

- створити функцію яка приймає масив та виводить кожен його елемент
- створити функцію яка створює параграф з текстом. Текст задати через аргумент
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
- створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
- створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
- створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
- створити функцію яка повертає найменьше число з масиву
- створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13

 */

//- створити функцію яка обчислює та повертає
// площу прямокутника зі сторонами а і б
/*
Формула для обчислення площі прямокутника
s = a * b;
s = площа прямокутника
а = ширина;
b = довжина;

*/
/*
(a+b)*2
*/
/*
function perimetr (shorterSide, longerSide) {
    let result = (shorterSide + longerSide) * 2;
    console.log(result);

}
perimetr(3, 8);
*/
//- створити функцію яка обчислює та повертає площу
// кола з радіусом r=5
/*
function circle (p,r) {
    let result = (3.14 * r);
    return result;

}
let x = circle (3.14,25);
console.log(x);

*/

/*
let p = 3.14;
let r = (Math.pow(5,2));
console.log(Math.pow(5,2));
 */

// - створити функцію яка обчислює та повертає площу
// циліндру висотою h, та радіутом r

 const squareCircle = (r) => Math.PI * Math.pow(r, 2)* h;
 console.log(squareCircle(5));

